backend/app/Controllers/API.php

INSERT INTO `users` (`nama`, `username`, `password`, `role_id`) VALUES ('admin', 'admin', 'asa', 2)
---
    public function PostUsers()
    {
        $contentType = $this->request->getHeaderLine('Content-Type');
        if ($contentType !== 'application/json') {
            return $this->response->setStatusCode(400)->setJSON(['status' => 'error', 'message' => 'Invalid content type']);
        }

        $rawInput = $this->request->getBody();
        $input = json_decode($rawInput);

        if (json_last_error() !== JSON_ERROR_NONE) {
            return $this->response->setStatusCode(400)->setJSON(['status' => 'error', 'message' => 'Invalid JSON format']);
        }

        $nama = $input->nama ?? '';
        $username = $input->username ?? '';
        $password = $input->password ?? '';
        $role_id = $input->role_id ?? 2;

        if (empty($nama) || empty($username) || empty($password) || empty($role_id)) {
            return $this->response->setStatusCode(400)->setJSON(['status' => 'error', 'message' => 'Invalid input data']);
        }

        $data = [
            'nama' => $nama,
            'username' => $username,
            'password' => $password,
            'role_id' => $role_id,
        ];

        $this->usersModel->insert($data);