backend/app/Controllers/Auth.php

    public function login()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->usersModel->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1