backend/app/Controllers/Laporan.php

    public function index()
    {
        $data = [
            'title' => 'Daftar laporan',
            'isi' => 'laporan/index',
            'tiket' => $this->tiketModel->findAll(),
---
SELECT *
FROM `tiket`