backend/app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'tahue'
 LIMIT 1
INSERT INTO `users` (`nama`, `username`, `password`, `role_id`) VALUES ('Rifal', 'tahue', 'aaaa', 2)
---
    public function register()
    {
        $data = $this->request->getJSON();
        $nama = $data->nama;
        $username = $data->username;
        $password = $data->password;
        $role_id = $data->role_id ?? 2;

        $existingUser = $this->usersModel->where('username', $username)->first();

        if ($existingUser) {
            return $this->respond(['message' => 'Username already exists'], 409);
        }

        $newUser = [
            'nama' => $nama,
            'username' => $username,
            'password' => $password, // Simpan password sebagai teks biasa
            'role_id' => $role_id,
        ];

        $this->usersModel->insert($newUser);