backend/app/Controllers/Tiket.php

SELECT *
FROM `tiket`
---
    public function getTiket()
    {
        $jadwal = $this->tiketModel->findAll();